// Aliasses 
// 1. primitives, union, intersection когда мы хотим создавать приметивы, юнионы, картежи и прочие комбинации
// их мы можем создавать только при помощи Alliases //* type!
// Ситуации со склеиванием мы не можем:
type Window // Duplicate identifier 'Window'


// interface:
// 1.Когда мы хотим  расширять interface в будующем!
// 2. Класс интерфейс for class we use Interface

//* В остальном и там и там мы можем расширять, добавляет опциональные параметры (readonly )
//* Так что с точки зрения создания объектов больше нету
//* Решают как правило на уровне разработки как удобно